---
kind: other
id: Methods.T:Autodesk.Revit.DB.Visual.AssetSetIterator
source: html/13a5dc28-bd27-f440-39a5-6d9a3e50e19d.htm
---
# AssetSetIterator Methods

Causes the object to release immediately any resources it may be utilizing.